---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SketchedStairsCurveData
source: html/6036756a-36d6-8200-d915-81d52da1e7aa.htm
---
# SketchedStairsCurveData Members

Construct a SketchedStairsCurveData defined by a curve associated with its height and slope type.